# _*_ coding: utf-8 _*_

"""
other_apptags.py by xianhu
"""

config_wdj = {
    "旅游出行": ["综合旅游服务", "攻略", "酒店·住宿", "周边游", "旅行工具·户外"],
    "金融理财": ["投资", "银行", "记账", "支付", "彩票", "理财工具"],
    "视频": ["在线视频", "电视·直播", "真人视频", "短视频", "视频播放器"],
    "购物": ["商城", "导购", "海淘", "团购·优惠券", "快递"],
    "音乐": ["在线音乐", "电台", "K歌", "铃声", "乐器", "音乐播放器"],
    "图像": ["相机", "拍视频", "图片美化·滤镜", "图片分享", "相册·图库"],
    "新闻阅读": ["新闻·资讯", "日报·杂志", "电子书", "听书", "漫画", "搞笑", "百科·问答", "画报"],
    "生活实用工具": ["天气", "美食·菜谱", "日历", "时钟", "扫码", "手工", "手电筒", "计算器"],
    "系统工具": ["Wi-Fi", "输入法", "浏览器", "搜索·下载", "安全", "优化", "传输", "root", "文件管理", "存储·云盘"],
    "美化手机": ["桌面·主题", "壁纸", "锁屏", "字体"],
    "效率办公": ["办公软件", "笔记", "效率", "文件管理", "存储·云盘", "邮箱"],
    "聊天社交": ["聊天", "交友", "婚恋", "社区", "微博", "匿名", "表情·头像"],
    "电话通讯": ["电话", "短信", "通讯录", "通讯辅助"],
    "交通导航": ["地图·导航", "交通票务", "公交·火车·航班", "打车", "违章查询"],
    "生活服务": ["餐厅推荐", "外卖", "生鲜配送", "找阿姨", "洗衣", "做饭", "按摩", "美甲·美容", "租房·短租", "搬家", "买房", "家装", "租车·用车", "代驾", "买车", "养车", "团购·优惠券", "电影", "演出", "快递", "求职·招聘", "分类信息", "营业厅"],
    "运动健康": ["运动·健身", "减肥", "健康", "用药·医疗"],
    "教育培训": ["语言学习·单词", "考试·驾考", "词典·翻译", "在线教育", "课程表", "作业", "儿童教育"],
    "丽人母婴": ["经期·孕期", "育儿社区", "儿童教育", "美容·美妆"],

    "休闲时间": ["切东西", "找茬", "减压", "宠物", "答题", "音乐节奏", "益智", "解谜"],
    "跑酷竞速": ["跑酷", "赛车", "摩托", "赛艇", "飞机"],
    "宝石消除": ["方块", "宝石", "连连看", "祖玛", "泡泡龙", "卡通"],
    "网络游戏": ["RPG", "动作竞技", "策略", "卡牌", "经营模拟"],
    "动作射击": ["横版", "射击", "3D", "飞行", "坦克", "狙击"],
    "扑克棋牌": ["斗地主", "棋类", "麻将", "桌游", "德州扑克", "纸牌"],
    "儿童益智": ["拼图", "识字", "智力开发", "数学"],
    "塔防守卫": ["闯关", "抢滩登陆"],
    "体育格斗": ["街机", "篮球", "足球", "网球", "台球", "其他球类"],
    "角色扮演": ["回合制", "即时战斗", "养成", "武侠", "魔幻", "动漫", "三国", "修仙"],
    "经营策略": ["纸牌", "战棋", "经营", "历史", "战争", "DOTA"]
}

config_baidu = {
    "社交通讯": ["聊天", "社交", "婚恋", "通讯"],
    "影音播放": ["音乐", "视频", "铃声", "播放器", "电台"],
    "系统工具": ["优化", "安全", "浏览器", "输入法"],
    "拍摄美化": ["相机", "照片美化", "摄像"],
    "理财购物": ["网购", "记账", "彩票", "股票基金", "银行"],
    "生活实用": ["日历", "天气", "医疗健康", "运动健身", "母婴", "美食", "娱乐", "生活服务"],
    "主题壁纸": ["壁纸", "动态壁纸", "桌面美化", "主题"],
    "资讯阅读": ["新闻", "漫画", "电子书", "笑话"],
    "旅游出行": ["地图导航", "旅行攻略", "购票", "酒店"],
    "办公学习": ["办公", "笔记", "考试学习", "驾考"],

    "休闲益智": ["消除", "物理", "音乐", "策略塔防", "休闲", "猜猜看"],
    "动作射击": ["跑酷", "格斗", "空战", "枪战", "坦克"],
    "赛车竞速": ["赛车", "摩托", "模拟驾驶"],
    "网络游戏": ["卡牌", "经营", "RPG", "动作"],
    "棋牌桌游": ["斗地主", "麻将", "棋类", "桌游", "纸牌"],
    "经营养成": ["战争", "经营", "装扮"],
    "角色扮演": ["解谜逃脱", "回合制", "ARPG", "三国"],
    "体育竞技": ["篮球", "足球", "桌球", "拳击", "趣味运动"],
    "模拟辅助": ["模拟器", "游戏助手", "攻略"]
}

config_360 = {
    "系统安全": [],
    "通讯社交": [],
    "影音视听": [],
    "新闻阅读": [],
    "生活休闲": [],
    "主题壁纸": [],
    "办公商务": [],
    "摄影摄像": [],
    "购物优惠": [],
    "地图旅游": [],
    "教育学习": [],
    "金融理财": [],
    "健康医疗": [],

    "角色扮演": [],
    "休闲益智": [],
    "动作冒险": [],
    "网络游戏": [],
    "体育竞速": [],
    "飞行射击": [],
    "经营策略": [],
    "棋牌天地": [],
    "儿童游戏": [],
}

config_yyb = {
    "视频": [],
    "音乐": [],
    "购物": [],
    "阅读": [],
    "导航": [],
    "社交": [],
    "摄影": [],
    "新闻": [],
    "工具": [],
    "美化": [],
    "教育": [],
    "生活": [],
    "安全": [],
    "旅游": [],
    "儿童": [],
    "理财": [],
    "系统": [],
    "健康": [],
    "娱乐": [],
    "办公": [],
    "通讯": [],

    "休闲益智": [],
    "网络游戏": [],
    "动作冒险": [],
    "棋牌中心": [],
    "飞行射击": [],
    "经营策略": [],
    "角色扮演": [],
    "体育竞速": [],
}


soft_classify = {
    "社交通讯": ["聊天社交", "电话通讯", "社交通讯", "通讯社交", "社交", "通讯"],

    "地图旅游": ["旅游出行", "交通导航", "地图旅游", "导航", "旅游"],
    "理财购物": ["金融理财", "购物", "理财购物", "购物优惠", "理财"],

    "影音播放": ["视频", "音乐", "影音播放", "影音视听", "娱乐"],
    "拍摄美化": ["图像", "美化手机", "拍摄美化", "主题壁纸", "摄影摄像", "摄影", "美化"],

    "运动健康": ["运动健康", "健康医疗", "健康"],
    "丽人母婴": ["丽人母婴", "儿童"],

    "资讯阅读": ["新闻阅读", "资讯阅读", "阅读", "新闻"],
    "办公学习": ["效率办公", "教育培训", "办公学习", "办公商务", "教育学习", "教育", "办公"],

    "生活实用": ["生活实用工具", "生活服务", "生活实用", "生活休闲", "生活"],
    "系统工具": ["系统工具", "系统安全", "工具", "安全", "系统"],
}


game_classify = {
    "儿童游戏": ["儿童益智", "儿童游戏"],
    "休闲益智": ["休闲时间", "休闲益智"],
    "宝石消除": ["宝石消除"],
    "跑酷竞速": ["跑酷竞速", "赛车竞速"],

    "棋牌桌游": ["扑克棋牌", "棋牌桌游", "棋牌天地", "棋牌中心"],
    "体育竞技": ["体育格斗", "体育竞技", "体育竞速"],

    "动作射击": ["动作射击", "动作冒险", "飞行射击"],
    "塔防守卫": ["塔防守卫"],
    "角色扮演": ["角色扮演"],
    "经营策略": ["经营策略", "经营养成"],

    "网络游戏": ["网络游戏"],
    "模拟辅助": ["模拟辅助"]
}
